In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
first_s = pd.Series(['Test1' , 'Test2', 'Test3' ], index =(1,2,3))
first_s

1    Test1
2    Test2
3    Test3
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
first_s.index = [11,12,13]
first_s

11    Test1
12    Test2
13    Test3
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
first_s.head(2)

11    Test1
12    Test2
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [5]:
dup_s = pd.Series(['Test1' , 'Test2', 'Test3' ], index = [1,2,3])
new_s = pd.concat([dup_s,first_s])
new_s

1     Test1
2     Test2
3     Test3
11    Test1
12    Test2
13    Test3
dtype: object

In [6]:
new_s.drop_duplicates()

1    Test1
2    Test2
3    Test3
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [7]:
co = ['ID' , 'Name'] 
student = pd.DataFrame(columns = co)
student

Empty DataFrame
Columns: [ID, Name]
Index: []

## Q6: Read educ_figdp_1_Data.csv file

In [8]:
data = pd.read_csv('educ_figdp_1_Data.csv')
data

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [10]:
data.loc[20:25 ,['TIME', 'GEO']]

    TIME                            GEO
20  2008  European Union (27 countries)
21  2009  European Union (27 countries)
22  2010  European Union (27 countries)
23  2011  European Union (27 countries)
24  2000  European Union (25 countries)
25  2001  European Union (25 countries)

In [12]:
data[20:25]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
20,2008,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
21,2009,European Union (27 countries),Total public expenditure on education as % of ...,5.38,e
22,2010,European Union (27 countries),Total public expenditure on education as % of ...,5.41,e
23,2011,European Union (27 countries),Total public expenditure on education as % of ...,5.25,e
24,2000,European Union (25 countries),Total public expenditure on education as % of ...,4.94,s